---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.FlexPipeType
source: html/265bb674-73f8-84a9-72ee-cfe519f10a8e.htm
---
# FlexPipeType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.